[{"source.name":null,"title":"Did Virat Kohli play the clinching role in Dinesh Karthik's selection over Rishabh Pant in World Cup 2019 squad? - Free Press Journal","author":"FPJ Web Desk","description":"Dinesh Karthik got the final nod for World Cup 2019 squadas BCCI announced the Indian squad for the tournament on April 15.","url":"https://www.freepressjournal.in/sports/did-virat-kohli-play-the-clinching-role-in-dinesh-karthiks-selection-over-rishabh-pant-in-world-cup-2019-squad/1507975","content":"It was a really a tough job for BCCI selectors to choose among Dinesh Karthik and Rishabh Pant as a backup-wicketkeeper for the World Cup 2019 squad. Dinesh Karthik got the final nod as BCCI announced the Indian squad for the tournament on April 15.\r\nAlthough… [+1201 chars]","publishedAt":"2019-04-19T07:43:00Z"},{"source.name":null,"title":"BP Drug Shows Promise for Treating Parkinson's - News18","author":"IANS","description":"This mechanism is known as autophagy, or 'self-eating', and involves cells eating and breaking down the materials.","url":"https://www.news18.com/news/lifestyle/bp-drug-shows-promise-for-treating-parkinsons-2109027.html","content":"Felodipine, a prescribed drug to treat high blood pressure, has shown promise against Parkinson's, Huntington's and forms of dementia in studies carried out in mice and zebrafish at the University of Cambridge.In a study published in the journal Nature Commun… [+1731 chars]","publishedAt":"2019-04-19T07:29:20Z"},{"source.name":null,"title":"General Elections 2019: Had \"Cursed\" Hemant Karkare, Brags Sadhvi Pragya, BJP Leaders Clap - NDTV News","author":null,"description":"Sadhvi Pragya Singh Thakur, the 2008 Malegaon blasts accused contesting the national election as a BJP candidate, has boasted that 26/11 hero Hemant Karkare died because she had \"cursed\" him.","url":"https://www.ndtv.com/india-news/general-elections-2019-had-cursed-hemant-karkare-brags-sadhvi-pragya-claps-from-bjp-leaders-2025501","content":"Sadhvi Pragya was flanked by BJP leaders who are seen clapping at the remarks against Hemant KarkareBhopal: Sadhvi Pragya Singh Thakur, the 2008 Malegaon blasts accused contesting the national election as a BJP candidate, has boasted that 26/11 hero Hemant Ka… [+2697 chars]","publishedAt":"2019-04-19T07:29:00Z"},{"source.name":null,"title":"Lok Sabha Election 2019 LIVE updates: Priyanka Chaturvedi will join Shiv Sena today, confirms Sanjay Raut - Firstpost","author":"FP Staff","description":"Lok Sabha Election 2019 LIVE updates: \"I am confident of Mulayam Singh Yadav's victory. He will ensure the upliftment of the backward classes,\" Mayawati said at their joint Mainpuri rally on Thursday. She came down heavily on the Narendra Modi dispensation an…","url":"https://www.firstpost.com/politics/lok-sabha-election-2019-live-updates-priyanka-chaturvedi-will-join-shiv-sena-today-confirms-sanjay-raut-6478751.html/amp","content":"You have updates13:31 (IST)\r\nUttar Pradesh election latest update\r\nEnsure Mulayam's victory, says Mayawati\r\n\"I am confident of Mulayam Singh Yadav's victory. He will ensure the upliftment of the backward classes,\" Mayawati said at their joint Mainpuri rally o… [+12252 chars]","publishedAt":"2019-04-19T07:22:00Z"},{"source.name":null,"title":"'Bande Mein Hai Dum': With New RaGa, Congress Conveys It’s Ready for Presidential Style Faceoff With Na... - News18","author":"Pallavi Ghosh","description":"The new Congress messaging is also a counter to the BJP’s hugely popular Modi Hai Toh Mumkin Hai campaign, which conveys the larger-than-life image of Modi as someone who alone can deliver.","url":"https://www.news18.com/news/india/bande-mein-hai-dum-with-new-raga-congress-conveys-its-ready-for-presidential-style-faceoff-with-namo-2108955.html","content":"New Delhi: In a subtle yet stark makeover for Rahul Gandhi, the Congress has released a new series of videos around the theme Bande Mein Hai Dum, launching a battle of personalities against Prime Minister Narendra Modi.The move marks a change of strategy for … [+2278 chars]","publishedAt":"2019-04-19T06:52:00Z"},{"source.name":null,"title":"Priyanka Chaturvedi quits Congress - The Hindu","author":"Special Correspondent","description":"Two days ago, in a tweet, she expressed her displeasure over reinstatement by the party on April 15 of some party workers in Mathura who had misbehaved with her at a recent press conference.","url":"https://www.thehindu.com/news/national/priyanka-chaturvedi-quits-congress/article26885815.ece","content":"Congress spokesperson Priyanka Chaturvedi, who had expressed her displeasure against the party in a tweet, is learnt to have submitted her resignation on Thursday night.\r\nThough there is no official confirmation as yet, sources in the party said she has quit … [+1219 chars]","publishedAt":"2019-04-19T06:51:55Z"},{"source.name":null,"title":"Hardik Patel slapped at a public meeting in Gujarat - Times of India","author":null,"description":"News News: NEW DELHI: Congress leader Hardik Patel on Friday was slapped at a public meeting in Surendernagar district, Gujarat.","url":"https://timesofindia.indiatimes.com/elections/news/hardik-patel-slapped-at-a-public-meeting-in-gujarat/articleshow/68950659.cms","content":null,"publishedAt":"2019-04-19T06:10:46Z"},{"source.name":null,"title":"Pleasant odour can control nicotine cravings - The Asian Age","author":"ANI","description":"Sniffing pleasant aroma could reduce the urge of smoking.","url":"https://www.asianage.com/life/health/190419/pleasant-odour-can-control-nicotine-cravings.html","content":"Sniffing pleasant aroma could reduce the urge of smoking.Washington: Researchers have discovered a unique method that can keep smokers away from cigarettes. Inhaling a pleasant odour could well be enough to decrease the urge to smoke, at least temporarily, an… [+3876 chars]","publishedAt":"2019-04-19T06:07:00Z"},{"source.name":null,"title":"Neither NDA nor UPA will form govt in 2019, there's hope and scope for Federal Front: Mamata Banerjee... - Firstpost","author":null,"description":"Speaking to News18 in an exclusive interview Trinamool Congress chief and West Bengal chief minister Mamata Banerjee hit out at Narendra Modi's brand of divisive politics and claimed that she had excellent relations with regional leaders across India.","url":"https://www.firstpost.com/politics/lok-sabha-election-2019-neither-nda-nor-upa-will-form-govt-in-2019-theres-hope-and-scope-for-federal-front-mamata-banerjee-tells-news18-6478131.html","content":"For Mamata Banerjee, the Bharatiya Janata Party is hardly the main Opposition in West Bengal, a state which she believes will stand up to the allegedly divisive politics peddled by Prime Minister Narendra Modi. Coming down as heavily on the BJP dispensation a… [+31637 chars]","publishedAt":"2019-04-19T05:57:56Z"},{"source.name":null,"title":"International Community must watch China's penchant for “setting up a different kitchen” - Economic Times","author":"Dipanjan Roy Chaudhury","description":"China is not compromising on controversial projects like CPEC despite India's protest.","url":"https://economictimes.indiatimes.com/news/defence/international-community-must-watch-chinas-penchant-for-setting-up-a-different-kitchen/articleshow/68950205.cms","content":"Pushback to the BRI projects has compelled China to initiate certain course correction. As the Malaysian railway project rethink suggest some ASEAN members could exert pressure on Beijing for mid-course correction ahead of second BRI summit scheduled on April… [+9780 chars]","publishedAt":"2019-04-19T05:45:00Z"},{"source.name":null,"title":"Discovery of eco-friendly material for refrigerators and ACs - The Asian Age","author":"ANI","description":"Researchers described the enormous thermal changes under pressure achieved with plastic crystals.","url":"https://www.asianage.com/science/190419/discovery-of-eco-friendly-material-for-refrigerators-and-acs.html","content":"Researchers described the enormous thermal changes under pressure achieved with plastic crystals.In a recent study, researchers have found an eco-friendly material that could replace the traditional coolants used in most refrigerators and air conditioners.\r\nT… [+2599 chars]","publishedAt":"2019-04-19T05:42:00Z"},{"source.name":null,"title":"Ranveer Singh and boys prepping hard for Kabir Khan’s ’83 will charge you up – watch BTS video - Times Now","author":null,"description":"The makers of ’83, on Friday, shared a brief video that has the cast training hard at Dharamshala’s HPCA stadium. The power-packed video, we must admit, has made our wait for the film even harder.","url":"https://www.timesnownews.com/entertainment/news/bollywood-news/article/ranveer-singh-and-boys-prepping-hard-for-kabir-khan-s-83-will-charge-you-up-watch-bts-video/402955","content":"Kabir Khans 83 is easily among the most awaited Hindi films of 2020. The sports drama is based on Indias historic win at the 1983 Cricket World Cup under the captainship of Kapil Dev, and features Ranveer Singh in the role of former skipper.\r\nRanveer, along w… [+1492 chars]","publishedAt":"2019-04-19T05:34:22Z"},{"source.name":null,"title":"Pak PM Imran Khan Appoints New Finance Ministry Chief Amid Economic Crisis - NDTV News","author":null,"description":"Pakistani Prime Minister Imran Khan made a sweeping cabinet reshuffle on Thursday after only seven months in power and appointed Abdul Hafeez Shaikh as de facto finance minister to steer the country through worsening economic turmoil.","url":"https://www.ndtv.com/world-news/pakistan-pm-imran-khan-appoints-new-finance-ministry-chief-amid-economic-crisis-2025432","content":"Abdul Hafeez Shaikh is de facto finance minister to steer Pakistan through worsening economic turmoil.ISLAMABAD: Pakistani Prime Minister Imran Khan made a sweeping cabinet reshuffle on Thursday after only seven months in power and appointed Abdul Hafeez Shai… [+3823 chars]","publishedAt":"2019-04-19T05:27:00Z"},{"source.name":null,"title":"Anand Ahuja gets down on his knees to tie Sonam Kapoor’s shoelace, get all the love on internet - Hindustan Times","author":"HT Correspondent","description":"Actor Sonam Kapoor and her husband Anand Ahuja were in Delhi on Thursday for the launch of a store. One of their photos from the event has gone viral for all the right reason.","url":"https://www.hindustantimes.com/bollywood/anand-ahuja-gets-down-on-his-knees-to-tie-sonam-kapoor-s-shoelace-get-all-the-love-on-internet/story-56vaUXL33vPxtv7WRZDEFI.html","content":"Sonam Kapoor Ahuja and Anand S Ahuja is a popular Bollywood couple and the two are constantly challenging conventional definitions of being married. The couple was in Delhi on Thursday for a store launch and displayed affection for each other in a different m… [+2150 chars]","publishedAt":"2019-04-19T05:11:00Z"},{"source.name":null,"title":"India news 'Fortunate to have a mind like that' – Virat Kohli lauds MS Dhoni 19 Apr - International Cricket Council","author":"ICC","description":"Virat Kohli, the India captain, has launched a stern defence of former captain MS Dhoni, saying it was “unfortunate to see so many people going after him”.","url":"https://www.icc-cricket.com/news/1189702","content":"Virat Kohli, the India captain, has launched a stern defence of former captain MS Dhoni, saying it was unfortunate to see so many people going after him.Dhoni may be one of Indias most successful captains, but hes had a thin rope with the fan base of late. Ti… [+2927 chars]","publishedAt":"2019-04-19T05:09:59Z"},{"source.name":null,"title":"In unflattering detail, Mueller report reveals Trump actions to impede inquiry - The Hindu","author":"Reuters","description":"The 448-page report provided fresh details of how U.S. President Donald Trump tried to force Robert Mueller’s ouster, directed members of his administration to publicly vouch for his innocence and dangled a pardon to a former aide to try to prevent him from c…","url":"https://www.thehindu.com/news/international/in-unflattering-detail-mueller-report-reveals-trump-actions-to-impede-inquiry/article26884852.ece","content":"Special Counsel Robert Muellers report on his inquiry into Russias role in the 2016 U.S. election described in extensive and sometimes unflattering detail how President Donald Trump tried to impede the probe, raising questions about whether he committed the c… [+9409 chars]","publishedAt":"2019-04-19T05:09:27Z"},{"source.name":null,"title":"No breakfast and late dinner may up heart attack risk: Study - Hindustan Times","author":"Press Trust of India","description":"The study found that people with the two eating habits had a four to five times higher likelihood of death, another heart attack, or angina (chest pain) within 30 days after hospital discharge for heart attack.","url":"https://www.hindustantimes.com/health/no-breakfast-and-late-dinner-may-up-heart-attack-risk-study/story-BkmaFkCkxqveQYUEAtHFgP.html","content":"People who skip breakfast and eat dinner near bedtime may have worse outcomes after a heart attack, a study has warned.\r\n The study found that people with the two eating habits had a four to five times higher likelihood of death, another heart attack, or angi… [+2444 chars]","publishedAt":"2019-04-19T04:56:00Z"},{"source.name":null,"title":"Facebook exposed millions of Instagram passwords - Greater Kashmir","author":null,"description":"A day after admitting it “unintentionally” uploaded emails of nearly 1.5 million of new users, Facebook has now revealed that millions of Instagram passwords were stored on its servers in a readable format. Last month, Facebook said that it fixed a security i…","url":"https://www.greaterkashmir.com/news/world/facebook-exposed-millions-of-instagram-passwords/","content":"A day after admitting it “unintentionally” uploaded emails of nearly 1.5 million of new users, Facebook has now revealed that millions of Instagram passwords were stored on its servers in a readable format.\r\nLast month, Facebook said that it fixed a security … [+1853 chars]","publishedAt":"2019-04-19T04:52:00Z"},{"source.name":null,"title":"TNDGE Result 2019 dge1.tn.nic.in: Tamil Nadu Plus Two result 2019 declared, 91.3% pass - Times of India","author":"Rajni Pandey","description":"Education News: Tamil Nadu 12th results 2019 was declared today, April 19, 2019, on the official website of the Tamil Nadu Board.","url":"https://timesofindia.indiatimes.com/home/education/news/tn-board-result-2019-live-updates-tn-hsc-result-2019-to-be-out-soon-tnresults-nic-in/articleshow/68948417.cms","content":"TN 12th results 2019 was announced on Friday, April 19, 2019, on the official website of the Tamil Nadu Board. The students who appeared for the Tamil Nadu +2 exam can check their result online on the official websites of the TNDGE after 9.30 AM. The TN Plus … [+2899 chars]","publishedAt":"2019-04-19T04:51:00Z"},{"source.name":null,"title":"Being bullied at school may up mental health issues - TheHealthSite","author":"IANS","description":"As per the findings of a new study, researchers found that being bullied in school increases the extent of mental health problems at age 25 by 40 per cent.","url":"https://www.thehealthsite.com/news/being-bullied-at-school-may-up-mental-health-issues/","content":"Parents, take note. If your child is being bullied in secondary school, it may dramatically increase his/her chances of mental health problems and unemployment later in life, researchers have warned.\r\nThe study, presented at the Royal Economic Society’s annua… [+1203 chars]","publishedAt":"2019-04-19T04:50:00Z"}]
